notebook/sed.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>sed笔记</title>
<!-- 2016-09-22 Thu 23:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Saul Lawliet" />
<link rel="stylesheet" type="text/css" href="/assets/css/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">sed笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">说明</a>
<ul>
<li><a href="#sec-1-1">基本使用方式</a></li>
<li><a href="#sec-1-2">部分参数说明</a></li>
</ul>
</li>
<li><a href="#sec-2">地址</a>
<ul>
<li><a href="#sec-2-1">addr1</a></li>
<li><a href="#sec-2-2">addr2</a></li>
</ul>
</li>
<li><a href="#sec-3">命令</a>
<ul>
<li><a href="#sec-3-1">Substitute</a></li>
<li><a href="#sec-3-2">Insert</a></li>
<li><a href="#sec-3-3">Append</a></li>
<li><a href="#sec-3-4">Delete</a></li>
<li><a href="#sec-3-5">Change</a></li>
<li><a href="#sec-3-6">Translate</a></li>
<li><a href="#sec-3-7">l</a></li>
<li><a href="#sec-3-8">Write</a></li>
<li><a href="#sec-3-9">Read</a></li>
<li><a href="#sec-3-10">Execute</a></li>
<li><a href="#sec-3-11">Quit</a></li>
<li><a href="#sec-3-12">=</a></li>
<li><a href="#sec-3-13">&amp;</a></li>
</ul>
</li>
<li><a href="#sec-4">参考</a></li>
</ul>
</div>
</div>
<hr  />

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">说明</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
本文使用的版本为 <code>sed (GNU sed) 4.2.2</code>, 其他版本不保证所有的功能和示例测试通过. <br  />
查看版本号命令: <code>sed --version |sed -n 1p</code>
</p>
</blockquote>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">基本使用方式</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>sed [-n] [-e] 'command(s)' files
<pre class="example">
sed '1d' books.txt # 删除第1行
sed '1d;2d;5d;' books.txt # 删除第1,2,5行
sed -e '1d' -e '2d' -e '5d' books.txt # 删除1,2,5行
</pre>
</li>

<li>sed [-n] -f scriptfile files
<pre class="example">
echo -e "1d\n2d\n5d" &gt; commands.txt
sed -f commands.txt books.txt
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">部分参数说明</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
-n, --quiet, --silent
	suppress automatic printing of pattern space
	抑制模式空间的自动打印
-e script, --expression=script
	add the script to the commands to be executed
	添加执行命令需要的脚本
-f script-file, --file=script-file
	add the contents of script-file to the commands to be executed
	添加执行命令需要的脚本文件
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">地址</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">addr1</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>number</code></td>
<td class="left">匹配指定数字的行</td>
</tr>

<tr>
<td class="left"><code>first~step</code></td>
<td class="left">从第first行开始的, 匹配每个step倍数行. 例如:50~5, 将会匹配(50,55,60,65&#x2026;)行</td>
</tr>

<tr>
<td class="left"><code>$</code></td>
<td class="left">匹配最后一行</td>
</tr>

<tr>
<td class="left"><code>/regexp/</code></td>
<td class="left">匹配所有'<code>/regexp/</code>'的行</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">addr2</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>n1,n2</code></td>
<td class="left">匹配[n1, n2]行</td>
</tr>

<tr>
<td class="left"><code>n1,+n2</code></td>
<td class="left">匹配[n1, n1+n2]行</td>
</tr>

<tr>
<td class="left"><code>n,/regexp/</code></td>
<td class="left">从第n行开始, 匹配至第一个 <code>/regexp/</code> 的行</td>
</tr>

<tr>
<td class="left"><code>/regexp/,n</code></td>
<td class="left">从第一个 <code>/regexp/</code> 的行开始, 匹配到第n行. 并在余下的行中匹配所有 <code>/regexp/</code></td>
</tr>

<tr>
<td class="left"><code>/regexp/,+n</code></td>
<td class="left">循环执行: 从下一个 <code>/regexp/</code> 的行开始, 匹配接下来的连续n行</td>
</tr>

<tr>
<td class="left"><code>/regexp/,~n</code></td>
<td class="left">循环执行: 从下一个 <code>/regexp/</code> 的行开始, 匹配至第一个行号是n的倍数</td>
</tr>

<tr>
<td class="left"><code>/regexp1/,/regexp2/</code></td>
<td class="left">循环执行: 从下一个 <code>/regexp1/</code> 的行开始, 匹配至第一个 <code>/regexp2/</code> 的行</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">命令</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Substitute</h3>
<div class="outline-text-3" id="text-3-1">
<p>
文本替换
</p>
<pre class="example">
[address1[,address2]]s/pattern/replacement/[flags]
</pre>
<ol class="org-ol">
<li><code>[flags]</code> 用法:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">g</td>
<td class="left">匹配全部</td>
</tr>

<tr>
<td class="left">2</td>
<td class="left">匹配第2次</td>
</tr>

<tr>
<td class="left">3g</td>
<td class="left">匹配除了前2次</td>
</tr>

<tr>
<td class="left">i</td>
<td class="left">忽略大小写</td>
</tr>

<tr>
<td class="left">p</td>
<td class="left">打印改变的行</td>
</tr>

<tr>
<td class="left">w file</td>
<td class="left">改变的行保存到文件</td>
</tr>
</tbody>
</table>
</li>
<li>在 <code>pattern</code> 中, 被 <code>\(</code> <code>\)</code> 包围的部分.<br  />
   在 <code>replacement</code> 中, 可以以 <code>\N</code> 的方式提取, 其中 <code>N</code> 表示第几个匹配
<pre class="example">
$ echo "Three One Two" | sed 's/\(\w\+\) \(\w\+\) \(\w\+\)/\2 \3 \1/'
One Two Three
</pre>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Insert</h3>
<div class="outline-text-3" id="text-3-2">
<p>
插入行
</p>
<pre class="example">
[address]i\
Insert text
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Append</h3>
<div class="outline-text-3" id="text-3-3">
<p>
追加行
</p>
<pre class="example">
[address]a\
Append text
</pre>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Delete</h3>
<div class="outline-text-3" id="text-3-4">
<p>
删除行
</p>
<pre class="example">
[address1[,address2]]d
</pre>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">Change</h3>
<div class="outline-text-3" id="text-3-5">
<p>
改变行
</p>
<pre class="example">
[address1[,address2]]c\
Replace text
</pre>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6">Translate</h3>
<div class="outline-text-3" id="text-3-6">
<p>
替换字符
</p>
<pre class="example">
[address1[,address2]]y/list-1/list-2/
</pre>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7">l</h3>
<div class="outline-text-3" id="text-3-7">
<p>
显示特殊字符, <code>[len]</code> 表示每行显示几个字符
</p>
<pre class="example">
[address1[,address2]]l
[address1[,address2]]l [len]
</pre>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8">Write</h3>
<div class="outline-text-3" id="text-3-8">
<p>
写入文件<br  />
   <code>sed -n 'w b.txt' a.txt</code> 等价于 <code>cp a.txt b.txt</code>
</p>
<pre class="example">
[address1[,address2]]w file
</pre>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9">Read</h3>
<div class="outline-text-3" id="text-3-9">
<p>
读取文件
</p>
<pre class="example">
[address]r file
</pre>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10">Execute</h3>
<div class="outline-text-3" id="text-3-10">
<p>
执行命令, 如果 <code>[command]</code> 省略, 将会执行 处理的文件 里面的命令
</p>
<pre class="example">
[address1[,address2]]e [command]
</pre>
</div>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11">Quit</h3>
<div class="outline-text-3" id="text-3-11">
<p>
退出sed, <code>[value]</code> 表示返回码
</p>
<pre class="example">
[address]q
[address]q [value]
</pre>
</div>
</div>

<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12">=</h3>
<div class="outline-text-3" id="text-3-12">
<p>
行号<br  />
   <code>sed -n '$=' a.txt</code> 等价于 <code>cat a.txt |wc -l</code>
</p>
<pre class="example">
[address1[,address2]]=
</pre>
</div>
</div>

<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13">&amp;</h3>
<div class="outline-text-3" id="text-3-13">
<p>
存储之前的成功匹配
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">参考</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><code>man sed</code>
</li>
<li><a href="http://www.tutorialspoint.com/sed/index.htm">http://www.tutorialspoint.com/sed/index.htm</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2016-09-22 Thu 23:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
